In [1]:
#Import necessary libraries for project
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

### 1. Data Exploring and Cleaning

In [4]:
#save csv to df variable
df = pd.read_csv('dsSalaries.csv')

In [7]:
#Inspect for columns and rows
df.shape

(3761, 9)

In [9]:
#Check for missing values and dtypes
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3761 entries, 0 to 3760
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   work_year         3761 non-null   int64
 1   experience_level  3761 non-null   object
 2   employment_type   3761 non-null   object
 3   job_title         3761 non-null   object
 4   salary            3761 non-null   int64
 5   salary_currency   3761 non-null   object
 6   salary_in_usd     3761 non-null   int64
 7   company_location  3761 non-null   object
 8   company_size      3761 non-null   object
dtypes: int64(3), object(6)
memory usage: 264.6+ KB

In [11]:
#Describe numeric features
df.describe()

         work_year        salary  salary_in_usd
count  3761.000000  3.761000e+03    3761.000000
mean   2022.374103  1.905999e+05  137555.178942
std       0.691252  6.711457e+05   63022.267974
min    2020.000000  6.000000e+03    5132.000000
25%    2022.000000  1.000000e+05   95000.000000
50%    2022.000000  1.375000e+05  135000.000000
75%    2023.000000  1.800000e+05  175000.000000
max    2023.000000  3.040000e+07  450000.000000

In [3]:
#First look into df 
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,company_location,company_size
0,2023,EN,FT,Applied Scientist,213660,USD,213660,US,L
1,2023,EN,FT,Applied Scientist,130760,USD,130760,US,L
2,2023,EN,FT,Data Quality Analyst,100000,USD,100000,NG,L
3,2023,EN,FT,Compliance Data Analyst,30000,USD,30000,NG,L
4,2023,EN,FT,Applied Scientist,204620,USD,204620,US,L

In [13]:
#Check values in experience_level column
df.experience_level.value_counts()

SE    2518
MI     809
EN     320
EX     114
Name: experience_level, dtype: int64

In [15]:
#Create dictionary to rename values in experience_level column
Positions = {'EN':'Entry-Level',
             'MI':'Mid-Level',
             'SE':'Senior-Level',
             'EX':'Excecutive-Level'}

In [16]:
df['experience_level'] = df['experience_level'].map(Positions)

In [17]:
df.experience_level.value_counts()

Senior-Level        2518
Mid-Level            809
Entry-Level          320
Excecutive-Level     114
Name: experience_level, dtype: int64

In [18]:
#Check values in employment_type column
df.employment_type.value_counts()

FT    3724
PT      17
CT      10
FL      10
Name: employment_type, dtype: int64

In [19]:
#Create dictionary to rename values in employment_type column
employment_types_new = {'FT':'Full_time',
             'PT':'Part_time',
             'CT':'Contract',
             'FL':'Freelance'}

In [20]:
df['employment_type'] = df['employment_type'].map(employment_types_new)

In [22]:
#Check values in company_size column
df.company_size.value_counts()

M    3157
L     456
S     148
Name: company_size, dtype: int64

In [23]:
#Create dictionary to rename values in company_size column
company_size_new = {'S':'Small',
             'M':'Medium',
             'L':'Large'}

In [24]:
#replace values
df['company_size'] = df['company_size'].map(company_size_new)

In [25]:
df.company_size.value_counts()

Medium    3157
Large      456
Small      148
Name: company_size, dtype: int64

In [27]:
#check new df with new values
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,company_location,company_size
0,2023,Entry-Level,Full_time,Applied Scientist,213660,USD,213660,US,Large
1,2023,Entry-Level,Full_time,Applied Scientist,130760,USD,130760,US,Large
2,2023,Entry-Level,Full_time,Data Quality Analyst,100000,USD,100000,NG,Large
3,2023,Entry-Level,Full_time,Compliance Data Analyst,30000,USD,30000,NG,Large
4,2023,Entry-Level,Full_time,Applied Scientist,204620,USD,204620,US,Large

In [29]:
#Drop salary and salary currency because we are going to use the salary_in_usd column only
df.drop(columns=['salary','salary_currency'], inplace=True)

In [30]:
df.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,company_location,company_size
0,2023,Entry-Level,Full_time,Applied Scientist,213660,US,Large
1,2023,Entry-Level,Full_time,Applied Scientist,130760,US,Large
2,2023,Entry-Level,Full_time,Data Quality Analyst,100000,NG,Large
3,2023,Entry-Level,Full_time,Compliance Data Analyst,30000,NG,Large
4,2023,Entry-Level,Full_time,Applied Scientist,204620,US,Large

In [32]:
#save new cleaned dataframe ready for visualization
df.to_csv('data_cleaned_capstone3.csv')